# 1) პროგრამირებაში დაშვებული შეცდომების ორი კატეგორია:
#    1. Bug (ბაგი) – ლოგიკური შეცდომა, რაც არ გაჩერებს პროგრამას, მაგრამ გამოიღებს არასწორ შედეგს
#    2. Exception (გამონაკლისი) – შეცდომა პროგრამის შესრულების დროს, რომელიც თუ არ დაიჭირეს, პროგრამა გაჩერდება
#    სხვა მაგალითები: 
#       SyntaxError, NameError, IndexError, ValueError

# 2) სიის მაგალითი და index-ის გამონაკლისის დამუშავება
my_list = [10, 20, 30]

try:
    print(my_list[5])  # 5-მა index-სი მიღმაა
except IndexError:
    print("Such index doesn’t exist")
