import { useState } from 'react'

import './App.css'
// 1) შექმენით კომპონენტი, რომელიც გვერდის ჩატვირთვისას წამოიღებს შემთხვევით ფაქტს ძაღლების შესახებ და გამოაჩენს ეკრანზე. მონაცემების წამოღება განახორციელეთ fetch-ით და Promise (.then(), .catch()) სინტაქსის გამოყენებით. დაამატეთ ღილაკი "ახალი ფაქტი", რომელზე დაჭერისას ხელახლა გაიგზავნება მოთხოვნა API-ზე.
// [https://catfact.ninja/fact](https://catfact.ninja/fact)
import { Dogs } from './COMPONENTS/Dogs'
// 2) შექმენით პროდუქტების კატალოგის კომპონენტი, რომელიც API-დან წამოიღებს პროდუქტების სიას და მომხმარებელს მისცემს საშუალებას გაფილტროს ისინი დასახელების მიხედვით.
// გამოიყენეთ useState პროდუქტების სიისთვის, input-ის ტექსტისთვის (search query), ჩატვირთვის ინდიკატორისთვის (loading) და შეცდომის მდგომარეობისთვის.
// API-დან მონაცემების წამოღება ჩაწერეთ useEffect-ში async/await სინტაქსისა და try...catch ბლოკის გამოყენებით.
// ეკრანზე გამოაჩინეთ საძიებო ველში ჩაწერილი ტექსტის მიხედვით გაფილტრული პროდუქტები.
// თუ ჩატვირთვა მიმდინარეობს, გამოაჩინეთ ტექსტი "იტვირთება...", ხოლო შეცდომის შემთხვევაში — შესაბამისი შეტყობინება.

// გამოიყენეთ fakestoreapi
import { Product } from './COMPONENTS/Products'
// 3) შექმენით კომპონენტი, სადაც მომხმარებელს შეეძლება input-ში ჩაწერილი ID-ის მიხედვით წამოიღოს კონკრეტული მომხმარებლის (User) მონაცემები. useState-ში შეინახეთ არჩეული ID  და მომხმარებლის მონაცემების ობიექტი.
// useEffect-ს dependency array-ში გადაეცით userId. ყოველ ჯერზე, როდესაც მომხმარებელი შეიყვანს ახალ ID-ს, useEffect ავტომატურად უნდა გაშვას და წამოიღოს ახალი მონაცემი.
// გამოიყენეთ async/await სინტაქსი.
// დაამატეთ Clean-up ფუნქცია, რომელიც გაუქმებულ/ძველ მოთხოვნებს აარიდებს თავს, თუ მომხმარებელი სწრაფად შეცვლის ID-ს.
import { Ids } from './COMPONENTS/Ids'
import Products2 from './COMPONENTS/Prod'
function App() {
  const [count, setCount] = useState(0)

  
  return (
    <>
    {/* n1 */}
    <Dogs/>

    {/* n2 */}
    {/* <Product/> */}

    {/* n3 */}
    {/* <Ids/> */}

    {/* <Products2/> */}
    </>
  )
}

export default App
