// 1)
let sum = 0;
for (let counter = 0; counter < 5; counter ++){
    sum += counter;
    if(counter == 3){
        break;
    }
}
console.log(sum); // ეს კოდი გამოიტანს 6 რადგან პირველ რიგში შექმნილი გვაქვს ცვლადი sum რომელიც უდრის რიცხვ 0-ს შემდეგ for loop iთ რიხცვებს ვაგენერირებთ 0 დან 5 მდე 4 ის ჩათვლით და sum -ს ვუმატებთ თითოეულ ოპერაციაზე რიცხვს მაგრამ როცა counter == 3 უნდა გაჩერდეს ლუპი პირველ ოპერაციაზე იქნება 0; მეორეზე 0 + 1 ანუ 1; მესამა ოპერაციაზე 1 + 2 ანუ 3; ჯამში გამოვიდა 6; ამ დროს ლუპი გაჩერდება რადგან counter == 3-ს

// 2)

var x = 0;
var i = 0;
do{
    x = x + i;
    i++;
    console.log(x)
}while (i < 5) // ეს კოდი გამოიტანს ჯერ 0-ს მერე 3-ს მერე 6-ს შემდეგ 10-ს რადგან: x += i და i ის მნიშვნელობას ყოველთვის ემატება 1-ი ეს ყველაფერი ხვდება სანამ i nაკლებია ხუთზე როცა i = 5 იქნება false და შეწყდება კოდიც.

// 3)

for(let x = 0; x <= 100; x +=2){
    console.log(x); // ეს კოდი დააგენერირებს რიცხვებს 0 დან 100 მდე 2 რიცხვის კ]გამოტოვებით ანუ გამოვა: 2, 4, 6...
}

// 4)

var x = 0;
while(x < 3){
    x++;
}
console.log(x) // ეს კოდი გამოიტანს 3 რადგან როცა x < 3 უნდა დაემატოს x-ს 1 როცა 3 გაუტოლდება იქნება false და შეწყდება ლუპი

// 5)

for(let i = 0; i < 10; i++){
    console.log(i) // იგივე როგორც მეოთხე დავალებაში
}


// 6)

let i = 0;
do{
    i++;
    if(i % 2 == 0){
        console.log(i)
    }
}while(i < 100) // ეს ლუპი დააგენერირებს 0 დან 100მდე რიცხვებს რომლებიც ლუწია

// 7)
// programing a loop used for to repeat a set of instructions until a stopping condition is met