// 2) შექმენით ფუნქცია, რომელიც მიიღებს მომხმარებლის ასაკს.
// თუ ასაკი არის 18 ან მეტი, დაბეჭდოს ტექსტი: "You're an adult"
// სხვა შემთხვევაში დაბეჭდოს ტექსტი: "You are not an adult"

function user_age(age){
    if(age >= 18){
        console.log("You're an adult")
    }else{
        console.log("You are not an adult")
    }
}

// 3) შექმენით ფუნქცია, რომელიც მიიღებს ტექსტს და დააბრუნებს ამ ტექსტში არსებული ასოების რაოდენობას.

function lenn(stringgg){
    return stringgg.length
}
console.log(lenn('qweqweqwe'))

// 4) შექმენით ფუნქცია, რომელიც მიიღებს რიცხვების მასივს და დააბრუნებს ყველა ელემენტის ჯამს.
function summ(){
    let c = 0
    for(let i = 0; i < summ.length; i++){
        c += summ[i]
    }
}
console.log(summ([1, 9, 5]))

// 5) შექმენით ფუნქცია, რომელიც დააბრუნებს რიცხვის კვადრატს.

function three1(x){
    return x ** 2
}
console.log(three1(10))

// 6) შექმენით ფუნქცია და გადაეცით მას სამი არგუმენტი. პასუხად დააბრუნეთ პირველი რიცხვი აყვანილი მეორეს ხარისხში და გამრავლებული მესამე რიცხვზე. ფუნქციას გაუწერეთ Default პარამეტრები.


function three(x, y, z){
    return (x ** y) * z
}
console.log(three(10, 20, 1))

// 7) ახსენით თუ რა განსხვავებაა return keyword-სა და console.log-ს შორის. მოიყვანეთ მინიმუმ 2-2 მაგალითი.

// return ის დახმარებით ფუნქციაშივე ვაბრუნებთ პასუხს ტერმინალში გამოსატანად უნდა დავაკონსოლოთ ფუნქციის სახელი. console.log პირდაპირ გამოაქვს ტერმინალში ნებისმიერი რამ.

// მოცემულ ყველა დავალებაში გამოიყენეთ return. ასევე, სიმარტივისთვის ყველა ფუნქცია ჯერ პითონში დაწერეთ (რათა ლოგიკას მიხვდეთ), შემდეგ კი Javascript-ში.