// 2) კომენატრების სახით ახსენით ყველა ის მეთოდი რომლებიც დღეს ჩვენ გაკვეთილზე ვისწავლეთ როგორიცაა map, filter, forEeach, findIndex, კარგად გაიაზრეთ მოცემული მეთოდების დანიშნულება, და თქვენით გააკეთეთ რამოდენიმე მაგალითი

// foreach - მეთოდი. ანუ თითო ელემენტისთვის რაღაცა გავაკეთოდ. ჩაშენებული მეთოდია ჯავასკრიპტში. არ აბრუნებს მნიშვნელობას, არ აბრუნებს ისევ ლისტად ანუ პირდაპირ თითო ხაზზე გამოაქვს ელემენტები
// სინტაქსი:

// .forEach(random => 
// console.log());

// callback - ანუ მაღალი რიგის ფუნქციის სახელი აქ გაწერილი პარამეტრად.

// .map() - iterator ის მეთოდი. დახმარებით ვფილტრავთ/ვუვლით ელემენტებს და ვცვილთ მის მნიშვნელობას მაგ. ვამატებთ რიცხვებს ნებისმიერ რიცხვს აბრინებს მნიშვნელობას ანუ undefind ს არ გამოგვიტანს ფორეჩის გან განსხვავებით, ის ასევე ლისტად ინახავს ელემენტებს 
// სინტაქსი:
// numbers.map((num) => * 2)
// console.log(numbers)


// .filter() - ით გავფილტრავთ მასივს/ელემენტს მას უნდა გადავცეთ ლოგიკურად შეკითხვა თუ true ინება ლისტში შეინახავს

// .findindex() დააბრუნებს იმ ელემენტს რომელიც პირველი დააკმაყოფილებს პირობას მხოლოდ ერთი ელემენტი გამოვა და დააბრუნებს მოცემული ელემენტის ინდექს. თუ ვერმოიძებნა ელემენტი მოცემული პირობით დააბრუნებს -1 თს

// 2) შექმენით მასივი სადაც შეინახავთ რიცხვებს, თქვენი დავალებაა, რომ filter მეთოდის გამოყენებით ახალ მასივში ჩაამატოთ ისეთი რიცხვები რომლებიც იყოფა 2 - ზე (ანუ ლუწია), კომენტარების სახით ახსენით ცვლის თუ არა filter მეთოდი ორიგინალ მასივს, აბრუნებს თუ არა ის მნიშვნელობას

// filter ორიგინალ მასივს არ ცვლის. იგი აბრუნებს მნიშვნელბას.

const listn = [1, 2, 3, 4, 5, 6, 7, 8]
const listFilter = listn.filter((n) => n % 2 === 0)
console.log(listFilter)
console.log('')

// 3) შექმენით მასივი სადაც შეინახავთ  სხვადასხვა სახეობის ხილს, თქვენი დავალებაა, რომ forEach მეთოდის გამოყენებით ცალ - ცალკე გამოიტანოთ ხილის სახელები ისე, რომ წინ ეწეროს My favorite fruit is - ხილის სახელი, აგრეთვე ახსენით აბრუნებს თუ არა forEach - მნიშვნელობას, და რითი განსხვავდება ის ტრადიციული for loop - სგან

// forEach ი მნიშვნელობას არ აბრუნებს ლისტის სახით, თითიეულ ხაზზე გამოიტანს მნიშვნელობებს for loop isგან იმით განსხვავდება რომ ერთ ხაზში იწერება მაგრამ არ შეგვიძლია რიცხვების დაგენერირება.

const fruits = ['banana', 'apple', 'orange', 'ananas', 'chery']
const fruitsNew = fruits.forEach((x) => console.log(`My favorite fruit is ${x}`))
console.log('')

// 4) შექმენით მასივი სადაც შეინახავთ სახელებს, თქვენი დავალებაა, რომ map მეთოდის გამოყენებით გამოიტანოთ თითოეული სიტყვის პირველი ასო და გადააქციოთ ის დიდ ასოდ, callback ფუნქციის მიერ დაბრუნებული მნიშვნელობა შეინახეთ ახალ მასივში, map ფუნქციის მიერ დაბრუნებული ახალი მასივი კი გამოიტანეთ console - ში

const names = ['Enrike', 'temo', 'saba', 'giga', 'irakli', 'sandro']
const nameMap = names.map((x) => x[0].toUpperCase())
const newMap = nameMap
console.log(nameMap)

// 5) მოიძიეთ ინფორმაცია reduce მეთოდის შესახებ js - ში ახსენით მისი დანიშნულება და კარგად გაიაზრეთ მისი მუშაობა, შემდეგ კი შექმენით მასივი სადაც შეინახავთ რიცხვებს და reduce მეთოდის გამოყენებით გამოიტანთ მოცემული რიცხვების ჯამს

// // reduce() - მასივს ამცირებს ერთ მნიშვნელობამდე.
// ხშირად გამოიყენება ჯამის, ნამრავლის, ობიექტის აგების დროს.
// აბრუნებს ერთ საბოლოო მნიშვნელობას.

// მაგალითად
// [1, 2, 3, 4, 5] ——> 15

const numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
const numberNew = numbers.reduce((res, num) => num + res)
console.log(numberNew)

// 6) კომენტარების სახით ახსენით განსხვავება higher order function და callback ფუნქციას შორის, მოიყვანეთ მაგალითებიც

// higher order function ი იღებს ერთი ფუნქციის სახელს და გადაეცემა მეორე ფუნქციის პარამეტრებს, callback ებს კი თვითონ ჰigher order function გადაეცემა
// callback დამხმარე ფუნქცია მაგ. მap, filtter ეს არის arrow function ი
// higher order function აბრუნებს სხვა ფუნქციაში დაბრუნებულ პასუხს.

