# control flow - კომპიუტერის მიერ ინსტრუქციების შესრულება
# control flow - შედგება სამი კომპონენტისაგან ესენია: sequensing, iteration, selection,
# sequesiong - კოდის თანმიმდევრობით გაშვება
# iteration - კოდის გამეორება
# selection - კოდში არჩევანის გაკეთება

# algoritm - არის ინსტრუქციების თანმიმდევრობა
# ალგორითმები შედგება: pseudocode, flowchart, natural language, სგან.
# კოდის სქემატურად გამოსახვას ვუწოდებთ flow chart ს
# ადამიანის ენასთან მიახლოებული კოდი pseudocode
# ბუნებრივი ენით ახსნილი კოდი natural lenguange

# 1რეცეპტის მიხედვით კერძის მომზადება – ნაბიჯ-ნაბიჯ მოქმედებები კერძის შესაქმნელად.
#  დილით გაღვიძების პროცესი – მაღვიძარა, პირის დაბანა, ჩაცმა და ა.შ.
#  ფულის გამოტანა ბანკომატიდან – ბარათის ჩადება, პინ-კოდის შეყვანა, თანხის შერჩევა და ფულის მიღება.

# flowchart - სქემატურად გამოსახული ნებისმიერი რამ
# pseudocode - ადამიანის ენასთან მიახლოებული კოდი რომლის წაკითხვ ადვილია 
# natural lenguage - ბუნებრივი ენით ახსნილი კოდი 

