// დაასრულეთ საკლასო დავალებები:

// 2) მომხმარებელს შემოაყვანინეთ რიცხვი ( 0 - 100 ) 
// ქულის მიხედვით დაადგინეთ შეფასება:

// 90--100 -> "A"
// 80--89 -> "B"
// 70--79 -> "C"
// 60--69 -> "D"
// 0--59 -> "F" 
// სხვა მნიშვნელობის შემთხვევაში -> "invalid score"
// (გამოიყენეთ switch case) 

let number = Number(prompt('enter number:'));

switch (true) {
    case number >= 90 && number <= 100:
        console.log("A");
        break;

    case number >= 80 && number <= 89:
        console.log("B");
        break;

    case number >= 70 && number <= 79:
        console.log("C");
        break;

    case number >= 60 && number <= 69:
        console.log("D");
        break;

    case number >= 0 && number <= 59:
        console.log("F");
        break;

    default:
        console.log("invalid score");
}

// 3) for loop-ის გამოყენებით დაბეჭდეთ რიცხვები 1-დან 10-მდე.

for(let i = 1;i <= 10; i ++){
    console.log(i)
}

// 4) for loop- ის გამოყენებით დაბეჭდეთ 1-დან 20-მდე მხოლოდ ლუწი რიცხვები.

for(let i = 0;i <= 20; i += 2){
    console.log(i)
}

// 5) for loop-ის გამოყენებით დაბეჭდეთ 1-დან 5-ის ჩათვლით ციფრების კვადრატები.

for(let i = 1;i <= 5; i ++){
    console.log(i ** 2)
}

// 6) for loop-ის გამოყენებით დაბეჭდეთ რიცხვები 35-დან 15-მდე.

for(let i = 35;i >= 15; i--){
    console.log(i)
}

// დამატებით შეასრულეთ:
// 7) კომენტარის სახით js-ის ფაილში ჩამოწერეთ loop-ის გამოყენების დადებითი მხარეები.

// Loop-ის გამოყენების დადებითი მხარეები:

// 1) ამცირებს კოდის გამეორებას 
// 2) ამარტივებს დიდი რაოდენობის ერთნაირი მოქმედების შესრულებას
// 3) კოდი ხდება უფრო მოკლე და წაკითხვადი
// 4) მარტივია ცვლილებების შეტანა
// 5) გამოიყენება მასივებთან, რიცხვებთან და გამეორებად ლოგიკასთან მუშაობისას
// 6) ზოგავს დროს და ამცირებს შეცდომების რისკს

// 8) სქემის სახით დახაზეთ JavaScript-ის for loop-ის სინტაქსი და შემადგენელი კომპონენტები. (+ კიდევ ერთხელ გადაავლეთ თვალი ჩაგდებულ რესურსებს)

// 9) დაწერეთ for loop, რომელიც გამოიტანს "Group 71 is the best"-ს კონსოლში 150-ჯერ.

for (let i = 1; i <= 150; i++) {
    console.log("Group 71 is the best");
}


// 10) prompt-ის გამოყენებით შემოატანინეთ მომხმარებელს სახელი და გვარი. გამოიყენეთ for loop, რომ კონსოლში მისი info 10-ჯერ გამოიტანოთ.

let fullName = prompt("შეიყვანე შენი სახელი და გვარი:");

for (let i = 1; i <= 10; i++) {
    console.log(fullName);
}
