// 1) დეტალურად ახსენით შემდეგი ექსპორტის გზები: export, export default და module.exports.

// export - (ანუ Named export) შეგვიძლია ფაილს გარეთ გავიტანოთ რაიმე მონაცემი მაგ. ცვლადი, ფუნქცია და რასახელითაც გავიტანთ იმ სახელით უნდა მივიღოთ დაიმპორტებისას შეზღუდვა არ გვაქვს უამრავი მონაცემის გატანა შეგვიძლია (client-ის თვის)

// export default - მხოლოდ ერთი რამის გატანა შეგვიძლია ფაილს გარეთ და არ აქვს მნიშვნელობა რა სახელით დავაიმპორტებთ რადგან მხოლოდ 1 თხელ შეგვიძლია გამოვიყენოთ ის (client-ის თვის)

// module.exports - იმშემთხვევაში თუ ბევრი მონაცემი გაგვაქვს ობიექტად უნდა გავიტანოთ ფაილს გარეთ რადგან 1 ზე მეტჯერ როცა ვიყენებთ მას პირველის მნიშვნელობა იშლება და მეორეს მნიშვნელობა გადაეცემა მას და ა.შ. (server-ის თვის)

// 2) დეტალურად ახსენით შემდეგი იმპორტები: import და require.

// import ის საშუალებით ვიღებთ მხოლოდ export, export defauld ს რომელიც ფაილს გარეთაა გატანილი და require ით ვიღებთ მხოლოდ module.exports რომელსაც ცვლადში ვინახავთ დაიმპორტებისას

// 3) შექმენით utils.js ფაილი და app.js ფაილი, შემდგომ utils ფაილში შექმენით 2 ფუნქცია getProducts და getUsers, მათი დავალება იქნება, რომ წამოიღონ პროდუქტები და user - ები.
// APIs:
// products - https://fakestoreapi.com/products
// users - 'https://fakestoreapi.com/users
// შემდგომ ეს ფუნქციები გაიტანეთ ფაილის გარეთ ან export - ით ან module.exports - ით და დააიმპორტეთ app.js  ფაილში ან import - ით ან require - თი (დამოკიდებულია იმაზე, თუ რომელი ექსპორტის გზას გამოიყენებთ) და შესაბამისად გამოიყენეთ ეს 2 ფუნქცია app.js ფაილში