# lambda არის ანონიმური ფუნქცია რომელსაც არ გააჩნია ფინქციია სახელი.

# 1) შექმენით lambda ფუნქცია რომელიც იღებს ორ რიცხვს. ფუნქციამ უნდა დააბრუნოს პირველი რიცხვი აყვანილი მეორეს ხარისხში.

two_num = lambda x, y: x ** y
print(two_num(10, 2))

# 2) შექმენით lambda ფუნქცია რომელიც იღებს მართკუთხედის სიგრძეს და სიგანეს, დააბრუნეთ ამ მართკუთხედის პერიმეტრი.

p = lambda width, height: (width * height) * 2
print(p(10, 20))

# 3) შექმენით lambda ფუნქცია რომელიც იღებს სიტყვას და ამ სიტყვას აბრუნებს დიდ ასოებში (Uppercase).

upper_case = lambda x: x.upper()
print(upper_case('random'))

# 4) შექმენით lambda ფუნქცია რომელიც რომელიც იღებს სიტყვას და აბრუნებს ამ სიტყვის სიგრძეს.

len_str = lambda y: len(y)
print(len_str('qweqweqwe'))