# *args და **kwargs ფუნქციებს საშუალებას აძლევს მიიღონ არგუმენტების უცნობი რაოდენობა.

# პარამეტრი *argsფუნქციას საშუალებას აძლევს მიიღოს პოზიციური არგუმენტების ნებისმიერი რაოდენობა.

# ფუნქციის შიგნით, argsხდება tuple, რომელიც შეიცავს ყველა გაცემულ არგუმენტს
# *args-ის გამოყენება რეგულარულ არგუმენტებთან ერთად


# **kwargs-ის გამოყენება საკვანძო სიტყვების ნებისმიერი რაოდენობის არგუმენტების მისაღებად
# პარამეტრი **kwargsფუნქციას საშუალებას აძლევს მიიღოს საკვანძო სიტყვის არგუმენტების ნებისმიერი რაოდენობა.

# ფუნქციის შიგნით kwargsხდება ლექსიკონი, რომელიც შეიცავს ყველა საკვანძო სიტყვის არგუმენტს