// 3) დააყენეთ Node.js

// 4) შექმენით myNum ცვლადი და დღეს ნასწავლი მათემატიკური ოპერატორების გამოყენებით განაახლეთ მისი მნიშვნელობები შემდეგნაირად:
// • დაუმატეთ 70
// • გამოაკელით 99
// • გაამრავლეთ 100-ზე
// • ბოლოს კი გაყავით 12-ზე
// საბოლოო პასუხი გამოიტანეთ კონსოლში

let myNum = 100;
myNum += 70;
myNum -= 99;
myNum *= 100;
myNum /= 100;

console.log(myNum)

// 5) ახსენით თუ რა დანიშნულება აქვს Increment/Decrement ოპერატორებს.

// 6) რას გამოიტანს ეს კოდები?
// let x = 5;
// x++;
// x --;
// x++;
// console.log(x); ეს კოდი გამოიტანს 6 რადგან ++ და -- არის ერთობითი მიმატება/გამოკლება ++ ამატებს რიცხვს 1 -- აკლებს 1-ს.

// let n = 1;
// n --;
// n++;
// n --;
// n++;
// console.log(n); ეს კოდი გამოიტანს 1-ს

// 7) 5 სხვადასხვა ცვლადში შეინახეთ მონაცემები თქვენი თავის შესახებ. გამოიყენეთ Template literal იმისათვის, რომ კონსოლში ერთი დიდი წინადადება დაბეჭდოთ.

let myName = 'ენრიკე';
let myAge = 15;
let myHobby = 'ფეხბურთი';
let city = 'batumi';

console.log(`ჩემი სახელია ${myName}, ვარ ${myAge} წლის, ჩემი ჰობია ${myHobby}, ვცხოვრობ ${city}-ში`)

// 8) ახსენით Template literal-ის სინტაქსი და ჩამოწერეთ თუ რა მსგავსებები/განსხვავებები აქვს პითონის f string-თან შედარებით. 

// Template Literal არის JavaScript-ის სტრინგების ჩაწერის თანამედროვე მეთოდი, რომელიც საშუალებას გვაძლევს ტექსტში მარტივად ჩავაშენოთ ცვლადები და გამოთვლები.

// Template Literal იწერება backtick სიმბოლოთი (`) და არა ჩვეულებრივი ბრჭყალებით (" ან ').

// სინტაქსი:

// ტექსტი ${ცვლადი}

// მაგალითი JavaScript-ში:

// let name = "Gio";
// let age = 16;

// let text = ჩემი სახელია ${name} და ვარ ${age} წლის;
// console.log(text);

// ${} გამოიყენება ცვლადის ან გამოთვლის ჩასასმელად სტრინგში.

// Python-ის f-string იგივე მიზანს ემსახურება, რაც JavaScript-ის Template Literal.

// Python-ის სინტაქსი:

// name = "Gio"
// age = 16

// text = f"ჩემი სახელია {name} და ვარ {age} წლის"
// print(text)

// მსგავსებები Template Literal-სა და Python f-string-ს შორის:

// ორივე საშუალებას გვაძლევს ცვლადების ჩასმას სტრინგში

// ორივეში გამოიყენება {}

// ორივე უფრო წაკითხვადია, ვიდრე კონკატინაცია

// ორივე მხარს უჭერს გამოთვლებს

// განსხვავებები Template Literal-სა და Python f-string-ს შორის:

// JavaScript-ში გამოიყენება backtick (`), Python-ში — ბრჭყალები

// JavaScript-ში გამოიყენება ${}, Python-ში მხოლოდ {}

// Python-ში საჭიროა f სტრინგის წინ, JavaScript-ში — არა

// 9) 4 ცვლადში შეინახეთ შემდეგი მონაცემები:
// • 'Group 71'
// • 80
// • true
// • 4.8

let goa = 'Group 71';
let num = 80;
let bol = true;
let float = 4.8;

console.log(typeof(goa))
console.log(typeof(num))
console.log(typeof(bol))
console.log(typeof(float))

// კონსოლში დაბეჭდეთ თითოეული ცვლადის მონაცემის ტიპი.