// block scope => როცა ფუნქციაში შევქმნით ცვლადს და იქვე ვიდახებთ ფუნქციაში
// scope pollution => დაბინძურება. როცა ფუნქციის გარეთ გვაქვს შექმნილი ცვლადი და იგივე სახელით გვაქ შექმნილი ფუნქციაში ცვლადი რომლის value განსხვავდება ამ დროს ფუნქციაში შექმნილ value ს ენიჭება უპირატესობა და ფუნქციის გარეთ რომ დავაკოსნოლოგოთ ფუნქციაში შექმნილ value ს გამოიტანს

// 1) განმარტეთ კომენტარის სახით რა სხვაობაა გლობალურ და ლოკალურ სკოუპს შორის 

// global scope => ხელმისაწვდომი ელემენტი გლობალურად რომელიც ფუნქციის/ფრჩხილების გარეთაა შექმნილი შეგვიძლია ფუნქციაშიც გამოვიყენოთ და მის გარეთაც
// local scope => როცა ფუნქციაში გვაქ შექმნილი ცვლადი რომელსაც ვერგამოვიყენებთ მის გარეთ ხელმისაწვდომია მხოლოდ ფუნქციაში

// 2) შექმენით ცვლადი გლობალურად და გამოიძახეთ ფუნქციაში 

const namee = 'enrike'

const func = () => {
    console.log(namee)
}

func()

// 3) შექმენით ფუნქცია შიგნით შექმენით ცვლადი დაპრინტეთ ფუნქციის გარეთ გაუშვით კოდი და ნახეთ რა შედეგი იქნება კომენტარის სახით ახსენით რატომ მიიღეთ ეგ შედეგი 


const func2 = () => {
    const number = 15
}

console.log(number) // გამოიტანს eror ს რადგან ფუნქციაშივე გვაქვს შექმნილი ცვლადი ანუ არის local scope და მისი გამოძახება შეუძლებელია ფუნქციის გარეთ


function stray(numbers){
    let common=0;

    if(numbers[0]===numbers[1] || numbers[0]===numbers[2]){ // თუ პირველი რიცხვი უდრის მეორეს ან პირველი რიცხვი უდრის მესამეს მაშინ commin ის მნიშვნელობა გახდება პირველი რიცხვი
        common=numbers[0]
    } else{ // სხვა შემთხვევაში common ი უტოლდება მეორე რიცხვს
        common=numbers[1]
    }

    for(let i=0; i<numbers.length; i++){ // for loop ით ვუვლით numbers 
        if(numbers[i]!== common){ // თუ numbers ის რომელიმე მნიშვნელობა არ უდრის commin ს return ში გამოვიტანთ ამ რიცხვს
            return number[i]
    }
    }
}

function findNeedle(haystack) {
    const index=haystack.indexOf('needle') // index ცვლადში ვინახავთ needle ს ინდექს haystack ში
    return "found the needle at position "+index // და ვამატებთ წინადადებას ცვლადს რაშიც ინდექსი გვაქ მოცემული
}