// 1) გადაიმეორეთ აქამდე გავლილი JS მასალა.

// 2) ივარჯიშეთ ბოლო 5 საშინაო და საკლასო დავალებაზე. (ყველა თავიდან დაწერეთ Level 116-ის ფოლდერში. აბსოლიტურად ყველას დავალებას შევამოწმებ ‼️

// 3) კომენტარის სახით ახსენით რას ეწოდება ფუნქცია და ზოგადად პროგრამირებაში რა დროს ვიყენებთ.

// ფუნქცია კოდის ბლოკი რომელსაც სახელი აქვს შეგვიძლია რამდენიმეჯერ გამოვიძახოთ. აადვილებს კოდის ორგანიზებას და გამეორებას. შეგვიძლია გასდავცეთ უამრავი არგუმენტი.

// 4) დაასრულეთ საკლასო დავალება.

// 5) ახსენით Splice-ის სინტაქსი. +  მოცემულია მასივი:

// splice ის საშუალებით მასივიდან ვაგდებთ კონკრეტულ ელემენტს, ან ელემენტებს;

// let arr = [10, 20, 30, 40, 50];
// წაშალეთ მასივიდან 30 და 40 ერთდროულად.

let arr = [10, 20, 30, 40, 50];
arr.splice(2, 2)
console.log(arr)

// 6) მოცემულია მასივი:

// let cities = ["Tbilisi", "Batumi", "Kutaisi", "London", "Rustavi"];
// შეამოწმეთ თუ მასივში არსებობს "London", წაშალეთ ის splice()-ით.

let cities = ["Tbilisi", "Batumi", "Kutaisi", "London", "Rustavi"];
for(let i = 0; i < cities.length; i++){
    if(cities[i] === 'London'){
        cities.splice(i, 1)
    }
}
console.log(cities)