// 1) გადაიმეორეთ აქამდე გავლილი JS მასალა.

// 2) ივარჯიშეთ ბოლო 5 საშინაო და საკლასო დავალებაზე. (ყველა თავიდან დაწერეთ Level 116-ის ფოლდერში. აბსოლიტურად ყველას დავალებას შევამოწმებ ‼️

// 3) კომენტარის სახით ახსენით რას ეწოდება ფუნქცია და ზოგადად პროგრამირებაში რა დროს ვიყენებთ.

// 4) დაასრულეთ საკლასო დავალება.

// 5) ახსენით Splice-ის სინტაქსი. +  მოცემულია მასივი:

// let arr = [10, 20, 30, 40, 50];
// წაშალეთ მასივიდან 30 და 40 ერთდროულად.

// 6) მოცემულია მასივი:

// let cities = ["Tbilisi", "Batumi", "Kutaisi", "London", "Rustavi"];
// შეამოწმეთ თუ მასივში არსებობს "London", წაშალეთ ის splice()-ით.