
// 5) შექმენით Form, სადაც დაამატებთ age input-ს. დაამატეთ ვალიდაცია, რომ შეამოწმოთ მომხმარებელს მხოლოდ რიცხვები შემოჰყავს თუ არა. თუ ეს კრიტერიუმი არ შესრულდება - alert-ით გამოიტანეთ შესაბამისი მესიჯი. მომხმარებელს არ მისცეთ ფორმის დადასტურების საშუალება თუ ამ კრიტერიუმს არ შეასრულებს.


function validatee(){
    const age1 = document.getElementById('age1').value

    if (isNaN(age1)) {
        console.log(1)
        alert('შეიყვანეთ რიცხვები!')
        return false
    }

    alert('წარმატებით დარეგისტრირდით!')
    return true
}

// JavaScript-ში isNaN() ფუნქცია განსაზღვრავს, არის თუ არა მნიშვნელობა რიცხვად გარდაქმნისას NaN (არ არის რიცხვი). 
// ამოწმებს რიცხვია თუ არა თუ მხოლოდ რიცხვებს შევიტანთ false არის თუ ასოებს შევიტანთ true