// 1) ცვლადში შეინახეთ თქვენი ასაკი, შემდეგ კი დაწერეთ Conditional statement-ები:
// თუ ასაკი ნაკლებია 10-ზე დაბეჭდეთ 'child', თუ ასაკი მეტია 10-ზე მაგრამ ნაკლებია 18-ზე კონსოლში გამოიტანეთ 'Teen', ყველა სხვა შემთხვევაში Adult.
let age = 15;
if(age < 10){
    console.log('child')
}else if(age > 10 && age < 18){
    console.log('Teen')
}else{
    console.log('Adult')
}

// 2) გამოიყენეთ Math.random() რათა დააგენერიროთ რენდომ რიცხვი 0-დან 100-მდე. თუ რიცხვი 50-ზე ნაკლები აღმოჩნდება გამოიტანეთ False, ხოლო თუ 50-ზე მეტი იქნება გამოიტანეთ False
let num = Math.floor(Math.random() * 101)
if(num < 50){
    console.log(false)
}else{
    console.log(true)
}

// შექმენით ორი ცვლადი და შეინახეთ ნებისმიერი მნიშვნელობა. მკაცრი შედარების ოპერატორით შეადარეთ ტოლია თუ არა მათი მნიშვნელობები ერთმანეთს. შედეგი გამოიტანეთ კონსოლში
let num1 = 100;
let num2 = '100';
let res = num1 === num2;

console.log(res)