// // 1) ჩამოწრეთ ყველა ის იტერატორის მეთოდი რომლებიც თქვენ იცით, თითოეულის დანიშნულება ახსენით კომენტარების სახით
// iterator - ები გვეხმარება ანუ მანიპულირება/გადავლა რომ მოვახდინოთ ელემენტებზე/მასივებზე

// foreach - მეთოდი. ანუ თითო ელემენტისთვის რაღაცა გავაკეთოდ. ჩაშენებული მეთოდია ჯავასკრიპტში. არ აბრუნებს მნიშვნელობას, არ აბრუნებს ისევ ლისტად ანუ პირდაპირ თითო ხაზზე გამოაქვს ელემენტები
// სინტაქსი:

// .forEach(random => 
// console.log());

// callback - ანუ მაღალი რიგის ფუნქციის სახელი აქ გაწერილი პარამეტრად.

// .map() - iterator ის მეთოდი. დახმარებით ვფილტრავთ/ვუვლით ელემენტებს და ვცვილთ მის მნიშვნელობას მაგ. ვამატებთ რიცხვებს ნებისმიერ რიცხვს აბრინებს მნიშვნელობას ანუ undefind ს არ გამოგვიტანს ფორეჩის გან განსხვავებით, ის ასევე ლისტად ინახავს ელემენტებს 
// სინტაქსი:
// numbers.map((num) => * 2)
// console.log(numbers)


// .filter() - ით გავფილტრავთ მასივს/ელემენტს მას უნდა გადავცეთ ლოგიკურად შეკითხვა თუ true ინება ლისტში შეინახავს

// .findindex() დააბრუნებს იმ ელემენტს რომელიც პირველი დააკმაყოფილებს პირობას მხოლოდ ერთი ელემენტი გამოვა და დააბრუნებს მოცემული ელემენტის ინდექს. თუ ვერმოიძებნა ელემენტი მოცემული პირობით დააბრუნებს -1 თს

// // 2) შექმენით მასივი სადაც შეინახავთ რიცხვებს 1 - 10 ჩათვლით, თქვენი დავალებაა, რომ console - ში გამოიტანეთ თოთო ელემენტი forEach - მეთოდის გამოყენებით

let numbers = [1, 2, 3, 4, 5, 6, 7, 9, 10]
numbers.forEach((x) => console.log(x))

// // 3) map - მეთოდის გამოყენებით numbers - მასივში არსებული თითო ელემენტი გადაამრავლეთ 2 - ზე, და გამოიტანეთ ახალი მასივი

const n = numbers.map((x) => x * 2)
console.log(n)

// // 4) findIndex - მეთოდის გამოყენებით console - ში გამოიტანეთ ისეთი რიცხვის index - რომელიც მეტია 3 - ზე

const findIndex = numbers.findIndex((x) => x > 3)
console.log(findIndex)

// // 5) numbers მასივი გაფილტრეთ ისეთი რიცვებისგან რომლებიც მეტია 5 - ზე

const filterr = numbers.filter((x) => x > 5)
console.log(filterr)