// 1) დაასრულეთ ორივე პროექტი 159-ე ლეველიდან.

// 2) ახსენით setTimeout-ის დანიშნულება და მისი სინტაქსი.

// setTimeout() არის JavaScript-ის ჩაშენებული ფუნქცია, რომელიც კოდის შესრულებას განსაზღვრული დროით აყოვნებს

// event loop ი არის ის რაც ჯავასკრიპტს აძლევს საშუალებას სწორი თანმიმდევრობით გაეშვას კოდი ტერმინალში/კონსოლში. js არის single-theaded როდესაც ზემოდან ქვემოთ მიუყვება კოდი და ერთდროულად მხოლოდ 1 რაღაც იმუშავოს. c++ მაგალითად არის multi-theaded ანუ ერთდროულად შეუძლია რამოდენიმე რაღაც ამუშაოს.

// 3) დაწერეთ კოდი, რომელიც კონსოლში გამოიტანს ტექსტს 'This is javaScript' ზუსტად 3 წამის დაგვიანებით.

// 4) შექმენით კოდი, რომელიც მაშინვე დაბეჭდავს: "პროცესი დაიწყო".
// 2 წამის შემდეგ დაბეჭდავს: "შუალედური ეტაპი".
// კიდევ 1 წამის შემდეგ (ანუ ჯამში 3 წამში) დაბეჭდავს: "დასრულდა!".

// 5) შექმენით ფუნქცია სახელით greet, რომელიც იღებს სახელს და ბეჭდავს: "Hello, {name}".
// გამოიყენეთ setTimeout ისე, რომ ეს ფუნქცია ამოქმედდეს 1.5 წამში და გადაეცით მას თქვენისახელი არგუმენტად.

// 6) დაწერეთ კოდი, რომელიც 3 წამში დაბეჭდავს "BOOM!".
// თუმცა, იქვე დაწერე მეორე setTimeout, რომელიც 2 წამში გააუქმებს (clearTimeout) პირველ ტაიმერს, ისე რომ "BOOM!" საერთოდ არ დაიბეჭდოს.

// 7) დაწერეთ for ციკლი, რომელიც 1-დან 5-მდე ციფრებს დაბეჭდავს, ოღონდ თითოეულ ციფრს შორის უნდა იყოს 1 წამიანი ინტერვალი.

// 8) გადახედეთ ჩანაწერის იმ ნაწილს თავიდან, სადაც Event Loop-ს ვხსნი.

// 9) უყურეთ ვიდეოს და კარგად გაიაზრეთ ის: