let arr = [0, 1, 2, 3, 4]; // შევქმენით რიცხვების მასივი.
let result = 0; // შევქმენით result ცვლადი რისი დახმარებითაც დავაჯამებთ და კონსოლში გამოვიტანთ;

for(let i = 0; i < arr.length; i ++){ // for ლუპით ვუვლით თითოეულ არრ-ს ელემენტებს;
    let val = arr[i] // val ს გაუტოლდა arr[i] რომელიც ყოველ იტერაციაზე იცვლება;

    if(val && val % 2 === 0){
        result += val; // თუ val ის მნიშვნელობა იქნება 0 ანუ იქნება false, თუ ნულის გარდა ნებისმიერი იქნება true, შემდეგ ვყოფთ ნაშთიანად ამ რიცხვს თუ უდრის 0-ს, თუ ეს ორივე პირობა შესრულდება result ს დაემატება val ის მნიშვნეკლობა, თუ აქედან მხოლოდ ერთი არის true და მეორე false არ შესრულდება რადგან && ოპერატორის გამოყენებით თუ ერთი რიცხვი მაინც false ა არ დაემატება val ი result-ს რადგან false მნიშვნელობას იღებს if - ი;
    }else if(val || val === 0){
        result += val ? 1: 10; // თუ შესრულდა ორივე პირობიდან ერთ ერთი მაინც result ს დაემატება 1 ი; თუ val არის 0 -ი მაშინ დაემატება 10
    }
    else{
        result += 100 // თუ არ შესრულდება if/else if პირობა 100 დაემატება result ს
    }
}